
async def N_culculate(I, L, h_list, mu_arr):

    # Початкові параметри
    #I       = 1     # Струм, А
    #L       = 50    # Індуктивність, мГн
    Bmax    = 0.7   # Максимальна індукція, Тл
    J       = 5     # Густина струму, А/мм2
    Kw      = 0.3   # Коеф. заповнення проводами
    Kf      = 0.75  # Коеф. феромагнітного заповнення (стрічка не на 100% заповнює простір, є пори)
    Kh      = 3     # Максимальне відношення висоти до товщини стінки
    q       = 7.35  # Щільність феромагнетика, г/см3
    Nmax    = 10000 # Максимально дозволена кількість витків
    dmin    = 50    # Мінімальний внутрішній діаметр осердя, мм (якщо 0, рахує сама)
    d2w     = 0     # Діаметр дроту. Якщо 0, програма сама рахує (мм)
    #h_list = [5,10,15,20,25,30,40,50] #высота сердечника

    pi  = 3.141592653589793
    mu0 = 4*pi*10**-7
    dmin = dmin/1000
    # Січення 1 проводу
    S1w = I/J   # Рахуєм автоматично
    if d2w>0:
        S1w = pi*(d2w**2)/4 # Рахуєм на основі введеної товщини дроту

    L   = L*10**-3  # Гн
    q   = q*1000    # кг/м3
    S1w = S1w/10**6 # м2 <<<=======================

    df = []
    for i in range(len(h_list)):
        list = [None]*len(mu_arr)
        df.append(list)


    # Головний цикл
    for mu in mu_arr:
        i=0
        for h in h_list:
            a = mu*mu0/pi
            b = 2*Bmax/I*(S1w/(Kw*pi))**0.5
            h = h/1000 # <<<=======================
            c = L/h
            for N in range(1, Nmax):
                value = a*N-b*N**0.5-c/N
                if -0.002 < value < 0.002:
                    h = int(h*1000)
                    h_index = h_list.index(h)
                    mu_index = mu_arr.index(mu)
                    df[h_index][mu_index] = N
                    break
            i+=1
    return df   





# H_list = [5,10,15,20,25,30,40,50]
# Mu_list = [19, 26, 40, 60, 90, 125, 147, 160, 175, 200, 300, 400, 500, 700, 1000, 3000, 10000, 30000, 50000, 90000]

# dic = N_culculate(1, 50, H_list, Mu_list)
# print(dic)
