def N_calculate(h_arr, mu_arr, params):
    L, I, Bmax, Kf, qf, J, dw, nw, Kw, qw, rw, Uf, Uw, dmin, Dmax, Nmax, Sw = params

    # ВХІДНІ ПАРАМЕТРИ
    #==== Основні параметри =========================
    #L  = 50     # Індуктивність, мГн
    #I  = 1      # Сила струму, А

    #==== Параметри осердя ==========================
    #Bmax = 0.4  # Максимальна робоча індукція, Тл
    #Kf   = 0.7  # Коефіцієнт феромагнітного заповнення
    #qf   = 7.35 # Щільність феромагнетика, г/см³

    #==== Параметри дроту ===========================
    #J  = 5      # Густина струму, А/мм²
    #dw = 1.2    # Діаметр дроту, мм (рахується автоматично або виставляється вручну)
    #nw = 1      # Кількість жил дроту
    #Kw = 0.3    # Коефіцієнт заповнення дротом
    #qw = 8.96   # Щільність матеріалу дроту
    #rw = 0.0172 # Питомий електроопір дроту, Ом·мм²/м

    #==== Вартість матеріалів =======================
    #Uf = 20     # Ціна кг феромагнетика, $
    #Uw = 50     # Ціна кг дроту, $

    #==== Обмеження параметрів ======================
    #dmin = 0    # Мінімальний внутрішній діаметр осердя, мм (якщо 0, не обмежується)
    #Dmax = 1000 # Максимальний зовнішній діаметр осердя, мм
    #Nmax = 100 # Максимально можлива кількість витків дроту

    #==== Константи (ніде не відображаються) ========
    pi = 3.141592653589793 # PI
    mu0 = 4*pi*10**-7      # Константа магнітної проникності

    #==== Масив проникностей та висоти ==============
    #mu_arr = [14,19,26,40,60,90,125,147,160,175,205,500,750,900,2300,3000,5000,10000]
    #h_arr  = [5,10,15,20,30,40,50]

    def calc_price(N, h, mu):          # (h, мм)

        le = N*I*mu*mu0/Bmax            # Довжина середньої лінії, м
        de = le/pi                      # Діаметр по середній лінії осердя, м
        Se = L*I/(Bmax*N)               # Ефективна площа поперечного перерізу, м²
        S = Se/Kf                       # Реальна площа поперечного перерізу, м²
        a = S/h                         # Товщина стінки осердя, м
        d = de-a                        # Внутрішній діаметр осердя, м
        D = de+a                        # Зовнішній діаметр осердя, м
        o  = D-d+2*h                    # Периметр січення осердя, м
        mf = L*I**2*mu*mu0*qf/Bmax**2   # Маса осердя, кг
        mw = o*N*Sw*qw                  # Маса дроту, кг
        price = round((Uf*mf + Uw*mw),3)            # Вартість $
        return price





    # ==========================
    # ОСНОВНИЙ РОЗРАХУНОК
    # ==========================

    # Приводимо вхідні параметри до системних
    L = L/1000
    qf = qf*1000
    qw = qw*1000
    rw = rw*10**-6
    dmin = dmin/1000
    Dmax = Dmax/1000

    

    #создание пустой матрицы (Mu x H)
    df, params = [], []
    for i in range(len(h_arr)):
        list = [{'N':None, 'price':None}]*len(mu_arr)
        df.append(list)



    # Головний цикл програми
    for mu in mu_arr:                          # Проходимось по всьому масиву проникностей
        for h in h_arr:                        # Проходимось по масиву висот
            h = h/1000
            for N in range(1, int(Nmax)):           # Проходимось по N
                le = N*I*mu*mu0/Bmax           # Довжина середньої лінії
                Se = L*I/(Bmax*N)              # Ефективна площа поперечного перерізу
                S = Se/Kf                      # Реальна площа поперечного перерізу
                a = S/h                        # Товщина стінки тороїда
                d = le/pi-a                    # Внутрішній діаметр тороїда
                dw0 = (4*N*Sw/pi)**.5          # Мінімальний внутрішній діаметр, в який поміщається дріт
                if (d>0 and d>dw0 and d>=dmin and d<=Dmax):
                    h_index = h_arr.index(h*1000)
                    mu_index = mu_arr.index(mu)
                    price = calc_price(N, h, mu)
                    df[h_index][mu_index] = {'N':N, 'price':price} # <<<<<<<<<<<<<<<< Зберігаємо все в глобальную матрицу
                    break                      # виходимо з циклу N
    return df  



###############################################################################################################################


def calc_params(N, h, mu, params):          # (h, мм)

    I, L, Bmax, Kf, qf, qw, J, dw, rw, Uf, Uw, Sw = params

    pi = 3.141592653589793
    mu0 = 4*pi*10**-7 
   

    # Приводимо вхідні параметри до системних
    L = L/1000
    qf = qf*1000
    qw = qw*1000
    rw = rw*10**-6


    h = h/1000                     # Висота осердя, м
    le = N*I*mu*mu0/Bmax            # Довжина середньої лінії, м
    de = le/pi                      # Діаметр по середній лінії осердя, м
    Se = L*I/(Bmax*N)               # Ефективна площа поперечного перерізу, м²
    S = Se/Kf                       # Реальна площа поперечного перерізу, м²
    a = S/h                       # Товщина стінки осердя, м
    d = de-a                        # Внутрішній діаметр осердя, м
    D = de+a                        # Зовнішній діаметр осердя, м
    o  = D-d+2*h                    # Периметр січення осердя, м
    mf = L*I**2*mu*mu0*qf/Bmax**2   # Маса осердя, кг
    mw = o*N*Sw*qw                  # Маса дроту, кг
    Lw = o*N                        # Довжина дроту, м
    Rw = rw*Lw/Sw                   # Опір дроту, Ом
    Pw = (I**2)*Rw                  # Втрати в дроті, Вт
    pf = Uf*mf                      # Вартість осердя, $
    pw = Uw*mw                      # Вартість дроту, $
    
    # Приводимо параметри до зручних одиниць і зберігаємо
    results = {
        "N":N,          # Кількість витків дроту
        "d":d*1000,     # Внутрішній діаметр осердя, мм
        "D":D*1000,     # Зовнішній діаметр осердя, мм
        "h":h*1000,     # Висота осердя, мм
        "mu":mu,        # Проникність осердя, одиниці
        "mf":mf*1000,   # Маса осердя, кг        
        "mw":mw*1000,   # Маса дроту, г
        "pf":pf,        # Ціна осердя, $ або UAH (немає значення, хоч "попугаї")
        "pw":pw,        # Ціна дроту, $ або UAH (немає значення, хоч "попугаї")
        "dw":dw,        # Діаметр дроту, мм
        "Pw":Pw         # Втрати в дроті, Вт
    }
    return results



# Перевірка роботи програми

# for item in params:
#     print("-------------")
#     for key, value in item.items():
#         print(f"{key}: {value}")



# mu_arr = [14,19,26,40,60,90,125,147,160,175,205,500,750,900,2300,3000,5000,10000]
# h_arr  = [5,10,15,20,30,40,50]
# params = [0.4, 0.7, 7.35, 8.96, 5.09295817894066, 0.111803398874989, 10, 0.6, 0, 1000, 10000, 20, 50]

# df = N_calculate(1, 50, h_arr, mu_arr, params)
# print(df)