info_page1 = """Калькулятор індуктора
в умовах роботи підмагнічування постійним струмом.
    """

info_page2 = """Дозволяє розрахувати оптимальні розміри тороїдального осердя та кількість витків дроту, виходячи з ціни матеріалів.

• "Блакитий" - найнижча ціна;

• "Зелений" - до 150% від найнижчої ціни;

• "Жовтий" - до 300% від найнижчої ціни;

• "Червоний" - більше 300% від найнижчої ціни.
    """

UA = {
    'params':{
        'title':'Додаткові параметри',
        'language': ' Мова',
####################
        'Core_params':'Параметри осердя',
        'Core_paramsInfo':
        """
        • Коефіцієнт феромагнітного заповнення (КФЗ) - визначається як відношення об'єму всього матеріалу до об'єму феромагнетика (від 0 до 1)

        • Щільність відноситься до матеріалу феромагнетика
        """,
        'Bmax':'Робоча індукція, Тл',
        'Kf':'КФЗ',
        'qf':'Щільність, г/см³',
####################
        'Wire_params':'Параметри дроту',
        'Wire_paramsInfo':
        """
        • Коефіцієнт укладки дроту: від 0 до 1

        • Питомий електроопір матеріалу дроту (для міді: 0,0172, алюмінію: 0,028)
        """,
        'J':'Густина струму, А/мм²',
        'dw':'Діаметр дроту, мм',
        'nw':'Кількість жил',
        'Kw':'Коефіцієнт укладки',
        'qw':'Щільність, г/см³',
        'rw':'Електроопір, Ом·мм²/м',
####################
        'Materials_cost':'Ціна за кг',
        'Materials_costInfo':
        """
        • Ціна за 1 кг феромагнетика та дроту в будь-якій валюті
        """,
        'Uf':'Феромагнетик, $',
        'Uw':'Дріт, $',
####################
        'Limits_params':'Обмеження',
        'Limits_paramsInfo':
        """
        • Ці параметри дозволяють обмежити внутрішній діаметр осердя (залиште 0 - без обмеження), зовнішній (має бути вказаний) та максимальна к-сть витків (за замовчуванням 10000)
        """,
        'dmin':'Мін Ø внутр., мм',
        'Dmax':'Макс. Ø зовн., мм',
        'Nmax':'Макс. к-сть витків',},

    'main':{
        'title':'Калькулятор дроселя',
        'info1': info_page1,
        'info2': info_page2,
        'L':'L, мГн',
        'I':'Струм, А',
        'table_name': 'Таблиця витків дроселя',
        'H_axis': 'Висота осердя, мм',
        'input_H': 'Значення H, мм',
        'input_mu': 'Значення μ',
        'input': 'Змiнити',
        'success': 'РОЗРАХОВАНО УСПIШНО',
        #chain with params-main
        'J': 'Густина струму',
        'dw': 'Діаметр дроту',
        'nw': 'Кількість жил',


        #bottom bar
        'core':'Осердя',
        'size':'мм',
        'muF':'μ:',
        'mf':'Маса (г)',

        'wire':'Дріт',
        'N':'Витки:',
        'Pw':'Втрати (Вт):',
        'mw':'Маса (г)',

        'order':' Замовити ',
        #modal window
        'confirm': '',
        'to_web':'Перейти на сайт?',
        'yes': 'Так',
        'no': 'Нi',
        }
}